[
  {
    "category": "namaz_inside",
    "sectionTitle": "নামাজের ভিতরের দোয়া",
    "items": [
      { "name": "সানা", "arabic": "سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ وَتَبَارَكَ اسْمُكَ وَتَعَالَى جَدُّكَ وَلاَ إِلَهَ غَيْرُكَ", "pronunciation": "সুবহানাকা আল্লাহুম্মা ওয়া বিহামদিকা, ওয়া তাবারাকাসমুকা ওয়া তায়ালা জাদ্দুকা ওয়া লা ইলাহা গাইরুকা।", "meaning": "হে আল্লাহ! আমি তোমারই পবিত্রতা ঘোষণা করছি এবং তোমারই প্রশংসা করছি। তোমার নাম বরকতময়, তোমার মর্যাদা অতি উচ্চ এবং তুমি ছাড়া আর কোনো ইলাহ নেই।" },
      { "name": "রুকুর দোয়া", "arabic": "سُبْحَانَ رَبِّيَ الْعَظِيم", "pronunciation": "সুবহানা রাব্বিয়াল আজীম", "meaning": "আমার মহান প্রতিপালকের পবিত্রতা বর্ণনা করছি।" },
      { "name": "সিজদার দোয়া", "arabic": "سُبْحَانَ رَبِّيَ الْأَعْلَى", "pronunciation": "সুবহানা রাব্বিয়াল আ'লা", "meaning": "আমার সর্বোচ্চ প্রতিপালকের পবিত্রতা বর্ণনা করছি।" },
      { "name": "তাশাহহুদ", "arabic": "التَّحِيَّاتُ لِلَّهِ وَالصَّلَوَاتُ وَالطَّيِّبَاتُ السَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ السَّلَامُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ", "pronunciation": "আত্তাহিয়াতু লিল্লাহি ওয়াস সালাওয়াতু ওয়াত তায়্যিবাতু, আসসালামু আলাইকা আইয়ুহান নাবিয়্যু ওয়া রাহমাতুল্লাহি ওয়া বারাকাতুহু। আসসালামু আলাইনা ওয়া আলা ইবাদিল্লাহিস সালিহীন। আশহাদু আল্লা ইলাহা ইল্লাল্লাহু ওয়া আশহাদু আন্না মুহাম্মাদান আবদুহু ওয়া রাসূলুহু।", "meaning": "সমস্ত মৌখিক, শারীরিক ও আর্থিক ইবাদত আল্লাহর জন্য। হে নবী! আপনার ওপর শান্তি, আল্লাহর রহমত ও বরকত বর্ষিত হোক। আমাদের ওপর এবং আল্লাহর নেক বান্দাদের ওপর শান্তি বর্ষিত হোক। আমি সাক্ষ্য দিচ্ছি যে আল্লাহ ছাড়া কোনো উপাস্য নেই এবং মুহাম্মদ (সা.) তাঁর বান্দা ও রাসূল।" },
      { "name": "দরূদ শরীফ", "arabic": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ...", "pronunciation": "আল্লাহুম্মা সাল্লি আলা মুহাম্মাদিওঁ ওয়া আলা আলি মুহাম্মাদ...", "meaning": "হে আল্লাহ! মুহাম্মদ (সা.) এবং তাঁর বংশধরদের ওপর রহমত বর্ষণ করুন..." },
      { "name": "দোয়া মাসুরা", "arabic": "اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْمًا كَثِيرًا...", "pronunciation": "আল্লাহুম্মা ইন্নি জালামতু নাফসি জুলমান কাসিরাওঁ...", "meaning": "হে আল্লাহ! আমি আমার নিজের ওপর অনেক জুলুম করেছি..." }
    ]
  },
  {
    "category": "namaz_outside",
    "sectionTitle": "নামাজের বাইরের দোয়া",
    "items": [
      { "name": "নামাজ শেষে দোয়া", "arabic": "اللَّهُمَّ أَنْتَ السَّلَامُ وَمِنْكَ السَّلَامُ تَبَارَكْتَ يَا ذَا الْجَلَالِ وَالْإِكْرَامِ", "pronunciation": "আল্লাহুম্মা আন্তাস সালামু ওয়া মিনকাস সালামু তাবারাক্তা ইয়া যাল জালালি ওয়াল ইকরম।", "meaning": "হে আল্লাহ! আপনিই শান্তি, আপনার থেকেই শান্তি আসে। আপনি বরকতময়, হে মহিমাময় ও মহানুভব।" },
      { "name": "ঘুমানোর দোয়া", "arabic": "اللَّهُمَّ بِاسْمِكَ أَمُوتُ وَأَحْيَا", "pronunciation": "আল্লাহুম্মা বিসমিকা আমুতু ওয়া আহইয়া", "meaning": "হে আল্লাহ! আপনার নাম নিয়েই আমি মৃত্যুবরণ (নিদ্রা) করি এবং জীবিত (জাগ্রত) হই।" },
      { "name": "ঘর থেকে বের হওয়ার দোয়া", "arabic": "بِسْمِ اللَّهِ تَوَكَّلْتُ عَلَى اللَّهِ لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ", "pronunciation": "বিসমিল্লাহি তাওয়াক্কালতু আলাল্লাহি লা হাওলা ওয়া লা কুওয়াতা ইল্লা বিল্লাহ", "meaning": "আল্লাহর নামে, আল্লাহর ওপরই ভরসা করলাম। আল্লাহর সাহায্য ছাড়া গুনাহ থেকে বাঁচার এবং নেক কাজ করার কোনো শক্তি নেই।" },
      { "name": "খাবার আগে দোয়া", "arabic": "بِسْمِ اللَّهِ وَعَلَى بَرَكَةِ اللَّهِ", "pronunciation": "বিসমিল্লাহি ওয়া আলা বারাকাতিল্লাহ", "meaning": "আল্লাহর নামে এবং আল্লাহর বরকতের ওপর (খাওয়া শুরু করলাম)।" }
    ]
  },
  {
    "category": "kalima",
    "sectionTitle": "কালেমা সমূহ",
    "items": [
      { "id": 1, "name": "কালেমা তাইয়্যেবা", "arabic": "لَا إِلَهَ إِلَّا اللهُ مُحَمَّدٌ رَسُولُ اللهِ", "pronunciation": "লা-ইলাহা ইল্লাল্লাহু মুহাম্মাদুর রাসূলুল্লাহ", "meaning": "আল্লাহ ছাড়া কোনো উপাস্য নেই, মুহাম্মদ (সা.) আল্লাহর রাসূল।" },
      { "id": 2, "name": "কালেমা শাহাদাত", "arabic": "أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ", "pronunciation": "আশহাদু আল্লা ইলাহা ইল্লাল্লাহু ওয়াহদাহু লা শারীকা লাহূ ওয়া আশহাদু আন্না মুহাম্মাদান আবদুহূ ওয়া রাসূলুহু।", "meaning": "আমি সাক্ষ্য দিচ্ছি যে আল্লাহ ছাড়া কোনো ইলাহ নেই, তিনি একক, তাঁর কোনো শরিক নেই। আমি আরও সাক্ষ্য দিচ্ছি যে মুহাম্মদ (সা.) তাঁর বান্দা ও রাসূল।" },
      { "id": 3, "name": "কালেমা তামজীদ", "arabic": "سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ وَلَا إِلَهَ إِلَّا اللَّهُ وَاللَّهُ أَكْبَرُ...", "pronunciation": "সুবহানাল্লাহি ওয়াল হামদুলিল্লাহি ওয়া লা ইলাহা ইল্লাল্লাহু ওয়াল্লাহু আকবার...", "meaning": "আল্লাহ পবিত্র, সব প্রশংসা আল্লাহর, আল্লাহ ছাড়া কোনো ইলাহ নেই, আল্লাহ মহান..." },
      { "id": 4, "name": "কালেমা তাওহীদ", "arabic": "لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ يُحْيِي وَيُمِيتُ...", "pronunciation": "লা ইলাহা ইল্লাল্লাহু ওয়াহদাহু লা শারীকা লাহু, লাহুল মুলকু ওয়া লাহুল হামদু...", "meaning": "আল্লাহ ছাড়া কোনো ইলাহ নেই, তিনি একক, তাঁর কোনো শরিক নেই, রাজত্ব ও প্রশংসা তাঁরই..." },
      { "id": 5, "name": "কালেমা ইস্তিগফার", "arabic": "أَسْتَغْفِرُ اللَّهَ رَبِّي مِنْ كُلِّ ذَنْبٍ...", "pronunciation": "আস্তাগফিরুল্লাহ রাব্বি মিন কুল্লি যাম্বিন...", "meaning": "আমি আমার পালনকর্তা আল্লাহর কাছে সব গুনাহ থেকে ক্ষমা চাচ্ছি..." },
      { "id": 6, "name": "কালেমা রদ্দে কুফর", "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ أَنْ أُشْرِكَ بِكَ شَيْئًا...", "pronunciation": "আল্লাহুম্মা ইন্নি আউযুবিকা মিন আন উশরিকা বিকা শাইয়ান...", "meaning": "হে আল্লাহ! আমি আপনার কাছে আশ্রয় চাচ্ছি আপনার সাথে কাউকে শরিক করা থেকে..." }
    ]
  },
  {
    "category": "wudu_ghusl",
    "sectionTitle": "অজু ও গোসল",
    "wudu": {
      "farz": ["সমস্ত মুখমন্ডল একবার ধোয়া", "উভয় হাত কনুইসহ একবার ধোয়া", "মাথার চার ভাগের এক ভাগ মাসেহ করা", "উভয় পা টাকনুসহ একবার ধোয়া"],
      "sunnat": ["নিয়ত করা", "বিসমিল্লাহ বলা", "কবজি পর্যন্ত হাত ধোয়া", "মিসওয়াক করা", "তিনবার কুলি করা", "তিনবার নাকে পানি দেওয়া"],
      "steps": [
        { "title": "১. নিয়ত ও বিসমিল্লাহ", "desc": "মনে মনে অজুর নিয়ত করে বিসমিল্লাহ বলে শুরু করা।" },
        { "title": "২. হাত ধোয়া", "desc": "দুই হাতের কবজি পর্যন্ত তিনবার ভালো করে ধোয়া।" },
        { "title": "৩. কুলি ও নাক পরিষ্কার", "desc": "তিনবার কুলি করা এবং তিনবার নাকে পানি দিয়ে নাক পরিষ্কার করা।" }
      ]
    },
    "ghusl": {
      "farz": ["গড়গড়া কুলি করা", "নাকে পানি দেওয়া (নরম জায়গা পর্যন্ত)", "পুরো শরীরে পানি পৌঁছানো"],
      "method": "প্রথমে দুই হাত ধোয়া, তারপর শরীরের কোথাও নাপাকি থাকলে তা পরিষ্কার করা। এরপর নামাজের অজুর মতো অজু করা। শেষে সারা শরীরে এমনভাবে পানি ঢালা যাতে এক চুল পরিমাণ জায়গাও শুকনো না থাকে।"
    }
  }
]