 [
    {
      "name": "সূরা ফাতিহা",
      "arabic": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ\nالْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ\nالرَّحْمَٰنِ الرَّحِيمِ\nمَالِكِ يَوْمِ الدِّينِ\nإِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ\nاهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ\nصِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ",
      "pronunciation": "বিসমিল্লাহির রাহমানির রাহিম। আলহামদু লিল্লাহি রাব্বিল আলামিন। আর রাহমানির রাহিম। মালিকি ইয়াওমিদ্দিন। ইয়্যাকা না’বুদু ওয়া ইয়্যাকা নাসতা‘ঈন। ইহদিনাস সিরাতাল মুস্তাকিম। সিরাতাল্লাযিনা আন‘আমতা আলাইহিম গাইরিল মাগদুবি আলাইহিম ওয়ালাদ্দাল্লিন।",
      "meaning": "শুরু করছি আল্লাহর নামে যিনি পরম করুণাময়, অতি দয়ালু। সকল প্রশংসা আল্লাহর, যিনি সকল জগতের প্রতিপালক। তিনি পরম করুণাময়, অতি দয়ালু। বিচার দিনের মালিক। আমরা শুধু তোমারই ইবাদত করি এবং শুধু তোমারই সাহায্য চাই। আমাদের সরল পথে পরিচালিত কর। সে পথ, যাদের তুমি নিয়ামত দান করেছ; যাদের ওপর তোমার গজব পড়েনি এবং যারা পথভ্রষ্ট নয়।"
    },
    {
      "name": "সূরা ইখলাস",
      "arabic": "قُلْ هُوَ اللَّهُ أَحَدٌ\nاللَّهُ الصَّمَدُ\nلَمْ يَلِدْ وَلَمْ يُولَدْ\nوَلَمْ يَكُن لَّهُ كُفُوًا أَحَدٌ",
      "pronunciation": "কুল হুয়াল্লাহু আহাদ। আল্লাহুস সামাদ। লাম ইয়ালিদ ওয়া লাম ইউলাদ। ওয়া লাম ইয়াকুল্লাহু কুফুওয়ান আহাদ।",
      "meaning": "বলুন, তিনি আল্লাহ—একক। আল্লাহ অমুখাপেক্ষী। তিনি কাউকে জন্ম দেননি এবং তাঁকেও জন্ম দেওয়া হয়নি। এবং তাঁর সমতুল্য কেউ নেই।"
    },
    {
      "name": "সূরা ফালাক",
      "arabic": "قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ\nمِن شَرِّ مَا خَلَقَ\nوَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ\nوَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ\nوَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ",
      "pronunciation": "কুল আ‘উযু বিরাব্বিল ফালাক। মিন শার্রি মা খালাক। ওয়া মিন শার্রি গাসিক্বিন ইযা ওয়াক্বাব। ওয়া মিন শার্রিন নাফফাসাতি ফিল উক্বাদ। ওয়া মিন শার্রি হাসিদিন ইযা হাসাদ।",
      "meaning": "বলুন, আমি আশ্রয় চাই প্রভাতের প্রতিপালকের কাছে—তিনি যা সৃষ্টি করেছেন তার অনিষ্ট থেকে, অন্ধকার রাতের অনিষ্ট থেকে যখন তা গভীর হয়, গিঁটে ফুঁ দেওয়া জাদুকারিণীদের অনিষ্ট থেকে এবং হিংসুকের অনিষ্ট থেকে যখন সে হিংসা করে।"
    },
    {
      "name": "সূরা নাস",
      "arabic": "قُلْ أَعُوذُ بِرَبِّ النَّاسِ\nمَلِكِ النَّاسِ\nإِلَٰهِ النَّاسِ\nمِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ\nالَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ\nمِنَ الْجِنَّةِ وَالنَّاسِ",
      "pronunciation": "কুল আ‘উযু বিরাব্বিন্নাস। মালিকিন্নাস। ইলাহিন্নাস। মিন শার্রিল ওয়াসওয়াসিল খান্নাস। আল্লাজি ইউওয়াসউইসু ফি সুদূরিন্নাস। মিনাল জিন্নাতি ওয়ান্নাস।",
      "meaning": "বলুন, আমি আশ্রয় চাই মানুষের প্রতিপালকের কাছে, মানুষের অধিপতির কাছে, মানুষের উপাস্যের কাছে—সে কুমন্ত্রণা দানকারীর অনিষ্ট থেকে, যে মানুষের অন্তরে কুমন্ত্রণা দেয়, জিন ও মানুষের মধ্য থেকে।"
    },
    {
      "name": "সূরা কাউসার",
      "arabic": "إِنَّا أَعْطَيْنَاكَ الْكَوْثَرَ\nفَصَلِّ لِرَبِّكَ وَانْحَرْ\nإِنَّ شَانِئَكَ هُوَ الْأَبْتَرُ",
      "pronunciation": "ইন্না আ‘ত্বাইনা কাল কাউসার। ফাসাল্লি লিরাব্বিকা ওয়ানহার। ইন্না শানিআকা হুয়াল আবতার।",
      "meaning": "নিশ্চয়ই আমরা আপনাকে কাউসার দান করেছি। অতএব আপনার প্রতিপালকের জন্য নামাজ পড়ুন এবং কুরবানি করুন। নিশ্চয়ই আপনার শত্রুই হবে নির্বংশ।"
    },
    {
      "name": "সূরা আসর",
      "arabic": "وَالْعَصْرِ\nإِنَّ الْإِنسَانَ لَفِي خُسْرٍ\nإِلَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ وَتَوَاصَوْا بِالْحَقِّ وَتَوَاصَوْا بِالصَّبْرِ",
      "pronunciation": "ওয়াল আসর। ইন্নাল ইনসানা লাফি খুসর। ইল্লাল্লাজিনা আমানু ওয়া আমিলুস সালিহাতি ওয়া তাওয়াসাও বিল হাক্বি ওয়া তাওয়াসাও বিস সাবর।",
      "meaning": "শপথ আসরের। নিশ্চয়ই মানুষ ক্ষতির মধ্যে রয়েছে। তবে তারা ছাড়া যারা ঈমান এনেছে, সৎকর্ম করেছে এবং পরস্পরকে সত্যের ও ধৈর্যের উপদেশ দিয়েছে।"
    },
    {
      "name": "সূরা কুরাইশ",
      "arabic": "لِإِيلَافِ قُرَيْشٍ\nإِيلَافِهِمْ رِحْلَةَ الشِّتَاءِ وَالصَّيْفِ\nفَلْيَعْبُدُوا رَبَّ هَٰذَا الْبَيْتِ\nالَّذِي أَطْعَمَهُم مِّن جُوعٍ وَآمَنَهُم مِّنْ خَوْفٍ",
      "pronunciation": "লি ইলাফি কুরাইশ। ইলাফিহিম রিহলাতাশ শিতাই ওয়াস সাইফ। ফালইয়াবুদু রাব্বা হাযাল বাইত। আল্লাজি আত‘আমাহুম মিন জু‘ইন ওয়া আমানাহুম মিন খাওফ।",
      "meaning": "কুরাইশদের আসক্তির কারণে—শীত ও গ্রীষ্মের সফরে তাদের আসক্তির কারণে—তারা যেন এ ঘরের প্রতিপালকের ইবাদত করে, যিনি তাদের ক্ষুধা থেকে খাদ্য দিয়েছেন এবং ভয় থেকে নিরাপত্তা দিয়েছেন।"
    }
  ]
